#include <stdio.h>

int main(int argc, char const* argv[]){
    int a = 0x55, b = 0xaa;
    if ((b & (0x01 << 3 )) != 0){
        printf("pass\n");
    }
    else {
        printf("fail\n");
    }
    return 0;
}

/*
ビットシフト演算子 (<<) :

0x01 << 3はビットシフト演算です。0x01（2進数で00000001）を左に3ビットシフトします。結果は00001000（10進数で8）になります。これはビット3を表しており、このビット位置だけが1で他は全て0です。
ビットごとのAND演算子 (&) :

b & (0x01 << 3)はビットごとのAND演算を行います。変数bの値と00001000（ビット3だけが1の値）をANDします。この演算の結果は、bのビット3が1の場合には00001000（非0）になり、0の場合には00000000（0）になります。
比較演算子 (!= 0) :

比較演算!= 0は、AND演算の結果が0ではないかどうかを検査します。つまり、bのビット3が1である場合には結果は0以外になり、この条件は真と評価されます。逆にビット3が0の場合は、結果が正確に0になるため、条件は偽と評価されます。
*/